app/controllers/admin/posts_controller.rb

  def create
    @post = Post.new(params[:post])
    if @post.save
---
INSERT INTO "posts" ("active", "approved_comments_count", "body", "body_html", "cached_tag_list", "created_at", "edited_at", "published_at", "slug", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"