app/controllers/comments_controller.rb

  def create
    authorize! :create, Comment
    @comment = @commentable.comments.new(params[:comment])
    @comment.user_id = current_user ? current_user.id : -1

    if @comment.save
---
INSERT INTO "comments" ("author", "author_email", "author_url", "body", "body_html", "created_at", "post_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"